aaron-bond.better-comments
akamud.vscode-theme-onedark
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
donjayamanne.githistory
donjayamanne.python-environment-manager
esbenp.prettier-vscode
formulahendry.code-runner
GrapeCity.gc-excelviewer
humao.rest-client
KevinRose.vsc-python-indent
LittleFoxTeam.vscode-python-test-adapter
Meezilla.json
mhutchie.git-graph
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-hub
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
njpwerner.autodocstring
Oracle.oracledevtools
PKief.material-icon-theme
Posit.shiny-python
Posit.shinyuieditor
quarto.quarto
RDebugger.r-debugger
redhat.vscode-xml
redhat.vscode-yaml
REditorSupport.r
ritwickdey.LiveServer
ryanluker.vscode-coverage-gutters
standard.vscode-standard
streetsidesoftware.code-spell-checker
tal7aouy.rainbow-bracket
tamasfe.even-better-toml
thisotherthing.vscode-todo-list
vscodevim.vim
wayou.vscode-todo-highlight